src/Documents/Пр_ПлановаяВыработкаЧасов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Пр_ПлановаяВыработкаЧасов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Пр_ПланФактоваяВыработка</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПлановыеЗначения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЧасов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/Пр_ПлановаяВыработкаЧасов/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПериодФормирования.ДатаНачала = Объект.НачалоПериода;
	ПериодФормирования.ДатаОкончания = Объект.КонецПериода;
	
	Если Не ЗначениеЗаполнено(ПериодФормирования) Тогда
		ПериодФормирования.ДатаНачала = НачалоМесяца(ТекущаяДатаСеанса());
		ПериодФормирования.ДатаОкончания = НачалоМесяца(ТекущаяДатаСеанса());
	КонецЕсли;  
	
	ДобавитьКолонкиКроссТаблицы(); 
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЗаполнитьКроссТаблицу();	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ПроверитьЗаполнение();
	ЗаполнитьКроссТаблицуВОбъект();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	РеквизитыФормы = ЭтотОбъект.ПолучитьРеквизиты("ПлановыеЗначения");
	Для Каждого РеквизитФормы Из РеквизитыФормы Цикл
		ИмяРеквизита = РеквизитФормы.Имя; 
		ПутьРеквизита = РеквизитФормы.Путь;
		ПроверяемыеРеквизиты.Добавить(СтрШаблон("%1.%2", ПутьРеквизита, ИмяРеквизита));
	КонецЦикла;                   

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПлановыеЗначения

&НаКлиенте
Процедура ПлановыеЗначенияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если ПлановыеЗначения.Количество() = 1 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Можно добавлять только 1 строку'"),,,,Отказ); 
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПлановыеЗначенияПриИзменении(Элемент)
	
	ТекДанные = Элементы.ПлановыеЗначения.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДатаНачала = ПериодФормирования.ДатаНачала;
	ДатаОкончания = НачалоМесяца(ПериодФормирования.ДатаОкончания);
		
	Пока ДатаНачала <> ДатаОкончания Цикл
		
		Месяц = Формат(ДатаНачала, "ДФ=MMMM"); 
		Год = Формат(ДатаНачала, "ДФ=yyyy");     
		
		МесяцИмя = ?(СтрДлина(Строка(Месяц(ДатаНачала))) = 1, СтрШаблон("0%1", Месяц(ДатаНачала)), Строка(Месяц(ДатаНачала)));
		ИмяРеквизитаПериод = СтрШаблон("Период_%1_%2", МесяцИмя, Год);   
		
		ТекДанные[ИмяРеквизитаПериод] = ДатаНачала;
		
		СледующийМесяц = ?(Месяц(ДатаНачала) <> 12, Строка(Месяц(ДатаНачала) + 1), "01");    
		СледующийГодСтрокой = Лев(Формат(ДатаНачала, "ДФ=yyyy"), СтрДлина(Формат(ДатаНачала, "ДФ=yyyy")) -1) + Строка(Число(Прав(Формат(ДатаНачала, "ДФ=yyyy"), 1)) + 1);
		СледующийГод = ?(Месяц(ДатаНачала) = 12, СледующийГодСтрокой, Формат(ДатаНачала, "ДФ=yyyy"));
		
		Если СтрДлина(СледующийМесяц) <> 2 Тогда
			СледующийМесяц = СтрШаблон("0%1", СледующийМесяц);	
		КонецЕсли;  
		
		ДатаНачала = СтроковыеФункцииКлиентСервер.СтрокаВДату(СтрШаблон("01.%1.%2", СледующийМесяц, СледующийГод));  
		
	КонецЦикла;
	
	Если ДатаНачала = ДатаОкончания Тогда
		
		Месяц = Формат(ДатаНачала, "ДФ=MMMM"); 
		Год = Формат(ДатаНачала, "ДФ=yyyy");  
		
		МесяцИмя = ?(СтрДлина(Строка(Месяц(ДатаНачала))) = 1, СтрШаблон("0%1", Месяц(ДатаНачала)), Строка(Месяц(ДатаНачала)));
		ИмяРеквизитаПериод = СтрШаблон("Период_%1_%2", МесяцИмя, Год);   
		
		ТекДанные[ИмяРеквизитаПериод] = ДатаНачала;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПериодФормированияПриИзменении(Элемент)
	
	УдалитьКолонкиКроссТаблицы();
	ДобавитьКолонкиКроссТаблицы();
	
	Объект.НачалоПериода = ПериодФормирования.ДатаНачала;     
	
	ПериодФормирования.ДатаОкончания = НачалоМесяца(ПериодФормирования.ДатаОкончания);
	Объект.КонецПериода = ПериодФормирования.ДатаОкончания;
	
	ПлановыеЗначенияПриИзменении(Неопределено);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Добавляет колонки кросс таблицы
//
&НаСервере
Процедура ДобавитьКолонкиКроссТаблицы()
	
	ДатаНачала = ПериодФормирования.ДатаНачала;
	ДатаОкончания = НачалоМесяца(ПериодФормирования.ДатаОкончания);
	
	ДобавляемыеРеквизиты = Новый Массив;
	
	Пока ДатаНачала <> ДатаОкончания Цикл
		
		Месяц = Формат(ДатаНачала, "ДФ=MMMM"); 
		Год = Формат(ДатаНачала, "ДФ=yyyy");     
		
		МесяцИмя = ?(СтрДлина(Строка(Месяц(ДатаНачала))) = 1, СтрШаблон("0%1", Месяц(ДатаНачала)), Строка(Месяц(ДатаНачала)));
		ИмяРеквизитаПериод = СтрШаблон("Период_%1_%2", МесяцИмя, Год);   
		ИмяРеквизитаКоличествоЧасов = СтрШаблон("КоличествоЧасов_%1_%2", МесяцИмя, Год);
		
		НовыйРеквизит = Новый РеквизитФормы(ИмяРеквизитаПериод, 
											ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата), 
											"ПлановыеЗначения",
											НСтр("ru = 'Период'"));

		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
		
		НовыйРеквизит = Новый РеквизитФормы(ИмяРеквизитаКоличествоЧасов, 
											ОбщегоНазначения.ОписаниеТипаЧисло(3, 0, ДопустимыйЗнак.Неотрицательный), 
											"ПлановыеЗначения",
											НСтр("ru = 'Количество часов'"));
											
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
		
		СледующийМесяц = ?(Месяц(ДатаНачала) <> 12, Строка(Месяц(ДатаНачала) + 1), "01");    
		СледующийГодСтрокой = Лев(Формат(ДатаНачала, "ДФ=yyyy"), СтрДлина(Формат(ДатаНачала, "ДФ=yyyy")) -1) + Строка(Число(Прав(Формат(ДатаНачала, "ДФ=yyyy"), 1)) + 1);
		СледующийГод = ?(Месяц(ДатаНачала) = 12, СледующийГодСтрокой, Формат(ДатаНачала, "ДФ=yyyy"));
		
		Если СтрДлина(СледующийМесяц) <> 2 Тогда
			СледующийМесяц = СтрШаблон("0%1", СледующийМесяц);	
		КонецЕсли;  
		
		ДатаНачала = СтроковыеФункцииКлиентСервер.СтрокаВДату(СтрШаблон("01.%1.%2", СледующийМесяц, СледующийГод));  
		
	КонецЦикла;
	
	Если ДатаНачала = ДатаОкончания Тогда
		
		Месяц = Формат(ДатаНачала, "ДФ=MMMM"); 
		Год = Формат(ДатаНачала, "ДФ=yyyy");  
		
		МесяцИмя = ?(СтрДлина(Строка(Месяц(ДатаНачала))) = 1, СтрШаблон("0%1", Месяц(ДатаНачала)), Строка(Месяц(ДатаНачала)));
		ИмяРеквизитаПериод = СтрШаблон("Период_%1_%2", МесяцИмя, Год);   
		ИмяРеквизитаКоличествоЧасов = СтрШаблон("КоличествоЧасов_%1_%2", МесяцИмя, Год);
		
		НовыйРеквизит = Новый РеквизитФормы(ИмяРеквизитаПериод, 
											ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата), 
											"ПлановыеЗначения",
											НСтр("ru = 'Период'"));

		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
		
		НовыйРеквизит = Новый РеквизитФормы(ИмяРеквизитаКоличествоЧасов, 
											ОбщегоНазначения.ОписаниеТипаЧисло(3, 0, ДопустимыйЗнак.Неотрицательный), 
											"ПлановыеЗначения",
											НСтр("ru = 'Количество часов'"));
											
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);

	КонецЕсли;
	
	ЭтотОбъект.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	ДатаНачала = ПериодФормирования.ДатаНачала;
	
	Пока ДатаНачала <> ДатаОкончания Цикл
		
		Месяц = Формат(ДатаНачала, "ДФ=MMMM"); 
		Год = Формат(ДатаНачала, "ДФ=yyyy");      
		
		МесяцИмя = ?(СтрДлина(Строка(Месяц(ДатаНачала))) = 1, СтрШаблон("0%1", Месяц(ДатаНачала)), Строка(Месяц(ДатаНачала)));		
		ИмяРеквизитаПериод = СтрШаблон("Период_%1_%2", МесяцИмя, Год);   
		ИмяРеквизитаКоличествоЧасов = СтрШаблон("КоличествоЧасов_%1_%2", МесяцИмя, Год);
		ИмяГруппы = СтрШаблон("%1_%2", Месяц, Год);
		
		НоваяГруппаФормы = Элементы.Добавить(ИмяГруппы, Тип("ГруппаФормы"), Элементы.ПлановыеЗначения);
		НоваяГруппаФормы.Вид = ВидГруппыФормы.ГруппаКолонок;
		НоваяГруппаФормы.Группировка = ГруппировкаКолонок.Горизонтальная;
		НоваяГруппаФормы.Заголовок = СтрШаблон("%1 %2", Месяц, Год);
		НоваяГруппаФормы.ОтображатьВШапке = Истина;
		НоваяГруппаФормы.ГоризонтальноеПоложениеВШапке = ГоризонтальноеПоложениеЭлемента.Центр;
		НоваяГруппаФормы.РастягиватьПоГоризонтали = Истина;
		
		НовыйЭлемент = Элементы.Добавить(ИмяРеквизитаПериод, Тип("ПолеФормы"), НоваяГруппаФормы);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = СтрШаблон("ПлановыеЗначения.%1", ИмяРеквизитаПериод);
		НовыйЭлемент.ГоризонтальноеПоложениеВШапке = ГоризонтальноеПоложениеЭлемента.Центр;
		НовыйЭлемент.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Центр;   
		НовыйЭлемент.РастягиватьПоГоризонтали = Истина;		    
		НовыйЭлемент.ТолькоПросмотр = Истина;
		
		НовыйЭлемент = Элементы.Добавить(ИмяРеквизитаКоличествоЧасов, Тип("ПолеФормы"), НоваяГруппаФормы);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = СтрШаблон("ПлановыеЗначения.%1", ИмяРеквизитаКоличествоЧасов);
		НовыйЭлемент.ГоризонтальноеПоложениеВШапке = ГоризонтальноеПоложениеЭлемента.Центр;
		НовыйЭлемент.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Центр;
		НовыйЭлемент.РастягиватьПоГоризонтали = Истина;		

		СледующийМесяц = ?(Месяц(ДатаНачала) <> 12, Строка(Месяц(ДатаНачала) + 1), "01");    
		СледующийГодСтрокой = Лев(Формат(ДатаНачала, "ДФ=yyyy"), СтрДлина(Формат(ДатаНачала, "ДФ=yyyy")) -1) + Строка(Число(Прав(Формат(ДатаНачала, "ДФ=yyyy"), 1)) + 1);
		СледующийГод = ?(Месяц(ДатаНачала) = 12, СледующийГодСтрокой, Формат(ДатаНачала, "ДФ=yyyy"));
		
		Если СтрДлина(СледующийМесяц) <> 2 Тогда
			СледующийМесяц = СтрШаблон("0%1", СледующийМесяц);	
		КонецЕсли;  
		
		ДатаНачала = СтроковыеФункцииКлиентСервер.СтрокаВДату(СтрШаблон("01.%1.%2", СледующийМесяц, СледующийГод));  
		
	КонецЦикла;
	
	Если ДатаНачала = ДатаОкончания Тогда
		
		Месяц = Формат(ДатаНачала, "ДФ=MMMM"); 
		Год = Формат(ДатаНачала, "ДФ=yyyy");
		
		МесяцИмя = ?(СтрДлина(Строка(Месяц(ДатаНачала))) = 1, СтрШаблон("0%1", Месяц(ДатаНачала)), Строка(Месяц(ДатаНачала)));				
		ИмяРеквизитаПериод = СтрШаблон("Период_%1_%2", МесяцИмя, Год);   
		ИмяРеквизитаКоличествоЧасов = СтрШаблон("КоличествоЧасов_%1_%2", МесяцИмя, Год);
		ИмяГруппы = СтрШаблон("%1_%2", Месяц, Год);
		
		НоваяГруппаФормы = Элементы.Добавить(ИмяГруппы, Тип("ГруппаФормы"), Элементы.ПлановыеЗначения);
		НоваяГруппаФормы.Вид = ВидГруппыФормы.ГруппаКолонок;
		НоваяГруппаФормы.Группировка = ГруппировкаКолонок.Горизонтальная;
		НоваяГруппаФормы.Заголовок = СтрШаблон("%1 %2", Месяц, Год); 
		НоваяГруппаФормы.ОтображатьВШапке = Истина;
		НоваяГруппаФормы.ГоризонтальноеПоложениеВШапке = ГоризонтальноеПоложениеЭлемента.Центр; 
		НоваяГруппаФормы.РастягиватьПоГоризонтали = Истина;	

		НовыйЭлемент = Элементы.Добавить(ИмяРеквизитаПериод, Тип("ПолеФормы"), НоваяГруппаФормы);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = СтрШаблон("ПлановыеЗначения.%1", ИмяРеквизитаПериод);  
		НовыйЭлемент.ГоризонтальноеПоложениеВШапке = ГоризонтальноеПоложениеЭлемента.Центр; 
		НовыйЭлемент.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Центр; 
		НовыйЭлемент.РастягиватьПоГоризонтали = Истина; 
		НовыйЭлемент.ТолькоПросмотр = Истина;
		
		НовыйЭлемент = Элементы.Добавить(ИмяРеквизитаКоличествоЧасов, Тип("ПолеФормы"), НоваяГруппаФормы);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = СтрШаблон("ПлановыеЗначения.%1", ИмяРеквизитаКоличествоЧасов);
		НовыйЭлемент.ГоризонтальноеПоложениеВШапке = ГоризонтальноеПоложениеЭлемента.Центр;
		НовыйЭлемент.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Центр; 
		НовыйЭлемент.РастягиватьПоГоризонтали = Истина;

	КонецЕсли;
	
КонецПроцедуры

// Удаляет колонки кросс таблицы
//
&НаСервере
Процедура УдалитьКолонкиКроссТаблицы()

	РеквизитыФормы = ЭтотОбъект.ПолучитьРеквизиты("ПлановыеЗначения");
	МассивУдаляемых = Новый Массив;
	Для Каждого РеквизитФормы Из РеквизитыФормы Цикл
		ИмяРеквизита = РеквизитФормы.Имя; 
		ПутьРеквизита = РеквизитФормы.Путь;
		МассивУдаляемых.Добавить(СтрШаблон("%1.%2", ПутьРеквизита, ИмяРеквизита));
	КонецЦикла;                   
	
	
	Если МассивУдаляемых.Количество() Тогда
		ЭтотОбъект.ИзменитьРеквизиты( , МассивУдаляемых); 
	КонецЕсли;
	
	УдалитьЭлементыКроссТаблицы();

КонецПроцедуры 

// Удаляет старые элементы формы
//
&НаСервере
Процедура УдалитьЭлементыКроссТаблицы()
	
	ЭлементыФормы = Элементы.ПлановыеЗначения.ПодчиненныеЭлементы;
	Для Каждого ПодчиненныйЭлемент Из ЭлементыФормы Цикл
		Если ПодчиненныйЭлемент.ПодчиненныеЭлементы.Количество() Тогда
			Для Каждого ПодчиненныйЭлемент2Уровень Из ПодчиненныйЭлемент.ПодчиненныеЭлементы Цикл
				Элементы.Удалить(ПодчиненныйЭлемент2Уровень);	
			КонецЦикла;
		КонецЕсли;
		Элементы.Удалить(ПодчиненныйЭлемент);	
	КонецЦикла;
	
КонецПроцедуры

// Заполняет кросс таблицу в объект
//
&НаСервере
Процедура ЗаполнитьКроссТаблицуВОбъект()
	
	СтрокаКроссТаблицы = Неопределено;
	Если ПлановыеЗначения.Количество() Тогда
		СтрокаКроссТаблицы = ПлановыеЗначения[0];
	КонецЕсли;
	
	Если СтрокаКроссТаблицы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДатаНачала = Объект.НачалоПериода;
	
	Пока ДатаНачала <> Объект.КонецПериода Цикл
		
		Месяц = Формат(ДатаНачала, "ДФ=MMMM"); 
		Год = Формат(ДатаНачала, "ДФ=yyyy");     
		
		МесяцИмя = ?(СтрДлина(Строка(Месяц(ДатаНачала))) = 1, СтрШаблон("0%1", Месяц(ДатаНачала)), Строка(Месяц(ДатаНачала)));
		ИмяРеквизитаПериод = СтрШаблон("Период_%1_%2", МесяцИмя, Год);   
		ИмяРеквизитаКоличествоЧасов = СтрШаблон("КоличествоЧасов_%1_%2", МесяцИмя, Год);
		
		НовоеПлановоеЗначение = Объект.ПлановыеЗначения.Добавить();
		НовоеПлановоеЗначение.Период = СтрокаКроссТаблицы[ИмяРеквизитаПериод];
		НовоеПлановоеЗначение.КоличествоЧасов = СтрокаКроссТаблицы[ИмяРеквизитаКоличествоЧасов];
		
		СледующийМесяц = ?(Месяц(ДатаНачала) <> 12, Строка(Месяц(ДатаНачала) + 1), "01");    
		СледующийГодСтрокой = Лев(Формат(ДатаНачала, "ДФ=yyyy"), СтрДлина(Формат(ДатаНачала, "ДФ=yyyy")) -1) + Строка(Число(Прав(Формат(ДатаНачала, "ДФ=yyyy"), 1)) + 1);
		СледующийГод = ?(Месяц(ДатаНачала) = 12, СледующийГодСтрокой, Формат(ДатаНачала, "ДФ=yyyy"));
		
		Если СтрДлина(СледующийМесяц) <> 2 Тогда
			СледующийМесяц = СтрШаблон("0%1", СледующийМесяц);	
		КонецЕсли;  
		
		ДатаНачала = СтроковыеФункцииКлиентСервер.СтрокаВДату(СтрШаблон("01.%1.%2", СледующийМесяц, СледующийГод));  
		
	КонецЦикла; 
	
	Если ДатаНачала = Объект.КонецПериода Тогда
		
		Месяц = Формат(ДатаНачала, "ДФ=MMMM"); 
		Год = Формат(ДатаНачала, "ДФ=yyyy");     
		
		МесяцИмя = ?(СтрДлина(Строка(Месяц(ДатаНачала))) = 1, СтрШаблон("0%1", Месяц(ДатаНачала)), Строка(Месяц(ДатаНачала)));
		ИмяРеквизитаПериод = СтрШаблон("Период_%1_%2", МесяцИмя, Год);   
		ИмяРеквизитаКоличествоЧасов = СтрШаблон("КоличествоЧасов_%1_%2", МесяцИмя, Год);
		
		НовоеПлановоеЗначение = Объект.ПлановыеЗначения.Добавить();
		НовоеПлановоеЗначение.Период = СтрокаКроссТаблицы[ИмяРеквизитаПериод];
		НовоеПлановоеЗначение.КоличествоЧасов = СтрокаКроссТаблицы[ИмяРеквизитаКоличествоЧасов];

	КонецЕсли;

	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКроссТаблицу()
	
	НоваяСтрока = ПлановыеЗначения.Добавить();
	Для Каждого Строка Из Объект.ПлановыеЗначения Цикл
		
		Месяц = Формат(Строка.Период, "ДФ=MMMM"); 
		Год = Формат(Строка.Период, "ДФ=yyyy");     
		
		МесяцИмя = ?(СтрДлина(Строка(Месяц(Строка.Период))) = 1, СтрШаблон("0%1", Месяц(Строка.Период)), Строка(Месяц(Строка.Период)));
		ИмяРеквизитаПериод = СтрШаблон("Период_%1_%2", МесяцИмя, Год);   
		ИмяРеквизитаКоличествоЧасов = СтрШаблон("КоличествоЧасов_%1_%2", МесяцИмя, Год);

		НоваяСтрока[ИмяРеквизитаПериод] = Строка.Период;
		НоваяСтрока[ИмяРеквизитаКоличествоЧасов] = Строка.КоличествоЧасов;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
